package variable;

public class Var5 {

	public static void main(String[] args) {

		/*
		 * 변수는 초기화를 반드시 해야한다. 초기화를 안하면 컴파일 오류가 난다.
		 * 
		 * 이유 컴퓨터의 메모리는 여러 시스템이 함께 사용하는 공간이다.그래서 어떠한 값들이 계속 저장된다. 변수를 선언하면 메모리상의 어떤 공간을
		 * 차지하고 사용한다. 그런데 그 공간에 기존의 어떤 값이 있었는지는 아무도 모른다. 따라서 초기화를 하지 않으면 이상한 값이 출력될 수
		 * 있다. 이런 문제를 예방하기 위해서 자바는 변수를 초기화 하도록 강제한다.
		 * 
		 */

		int a;
		//System.out.println(a); //변수를 초기화하지 않았기 때문에 컴파일 에러가 난다.
		/*
		 * 참고 지역변수(Local Variable)라고 하는데, 지역변수는 개발자가 직접 초기화를 해주어야한다. 클래스 변수와 인스턴스 변수는
		 * 자바가 자동으로 초기화를 진행해준다.
		 */
	}

}
